vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7032.inc
T_T1LD                         EQU       T1LD      -TIMER1BASE
T_T1VAL                        EQU       T1VAL     -TIMER1BASE
T_T1CON                        EQU       T1CON     -TIMER1BASE
T_T1CLRI                       EQU       T1CLRI    -TIMER1BASE
T_T1CAP                        EQU       T1CAP     -TIMER1BASE

T1LD_OFFSET                    EQU       0x0320
T1VAL_OFFSET                   EQU       0x0324
T1CON_OFFSET                   EQU       0x0328
T1CLRI_OFFSET                  EQU       0x032C
T1CAP_OFFSET                   EQU       0x0330

; Wake Up Timer

TIMER2BASE                     EQU       0xFFFF0340
T2LD                           EQU       0xFFFF0340
T2VAL                          EQU       0xFFFF0344
T2CON                          EQU       0xFFFF0348
T2CLRI                         EQU       0xFFFF034C
Z_T2LD                         EQU       T2LD      -Z_BASE
Z_T2VAL                        EQU       T2VAL     -Z_BASE
Z_T2CON                        EQU       T2CON     -Z_BASE
Z_T2CLRI                       EQU       T2CLRI    -Z_BASE

T_T2LD                         EQU       T2LD      -TIMER2BASE
T_T2VAL                        EQU       T2VAL     -TIMER2BASE
T_T2CON                        EQU       T2CON     -TIMER2BASE
T_T2CLRI                       EQU       T2CLRI    -TIMER2BASE

T2LD_OFFSET                    EQU       0x0340
T2VAL_OFFSET                   EQU       0x0344
T2CON_OFFSET                   EQU       0x0348
T2CLRI_OFFSET                  EQU       0x034C

; Watchdog Timer

TIMER3BASE                     EQU       0xFFFF0360
T3LD                           EQU       0xFFFF0360
T3VAL                          EQU       0xFFFF0364
T3CON                          EQU       0xFFFF0368
T3CLRI                         EQU       0xFFFF036C
Z_T3LD                         EQU       T3LD      -Z_BASE
Z_T3VAL                        EQU       T3VAL     -Z_BASE
Z_T3CON                        EQU       T3CON     -Z_BASE
Z_T3CLRI                       EQU       T3CLRI    -Z_BASE

T_T3LD                         EQU       T3LD      -TIMER3BASE
T_T3VAL                        EQU       T3VAL     -TIMER3BASE
T_T3CON                        EQU       T3CON     -TIMER3BASE
T_T3CLRI                       EQU       T3CLRI    -TIMER3BASE

T3LD_OFFSET                    EQU       0x0360
T3VAL_OFFSET                   EQU       0x0364
T3CON_OFFSET                   EQU       0x0368
T3CLRI_OFFSET                  EQU       0x036C

; PLL and Oscillator Control

PLLBASE                        EQU       0xFFFF0400
PLLSTA                         EQU       0xFFFF0400
POWKEY0                        EQU       0xFFFF0404
POWCON                         EQU       0xFFFF0408
POWKEY1                        EQU       0xFFFF040C
PLLKEY0                        EQU       0xFFFF0410
PLLCON                         EQU       0xFFFF0414
PLLKEY1                        EQU       0xFFFF0418
OSC0TRM                        EQU       0xFFFF042C
OSC0CON                        EQU       0xFFFF0440
OSC0STA                        EQU       0xFFFF0444
OSC0VAL0                       EQU       0xFFFF0448
OSC0VAL1                       EQU       0xFFFF044C
Z_PLLSTA                       EQU       PLLSTA    -Z_BASE
Z_POWKEY0                      EQU       POWKEY0   -Z_BASE
Z_POWCON                       EQU       POWCON    -Z_BASE
Z_POWKEY1                      EQU       POWKEY1   -Z_BASE
Z_PLLKEY0                      EQU       PLLKEY0   -Z_BASE
Z_PLLCON                       EQU       PLLCON    -Z_BASE
Z_PLLKEY1                      EQU       PLLKEY1   -Z_BASE
Z_OSC0TRM                      EQU       OSC0TRM   -Z_BASE
Z_OSC0CON                      EQU       OSC0CON   -Z_BASE
Z_OSC0STA                      EQU       OSC0STA   -Z_BASE
Z_OSC0VAL0                     EQU       OSC0VAL0  -Z_BASE
Z_OSC0VAL1                     EQU       OSC0VAL1  -Z_BASE

T_PLLSTA                       EQU       PLLSTA    -PLLBASE   
T_POWKEY0                      EQU       POWKEY0   -PLLBASE   
T_POWCON                       EQU       POWCON    -PLLBASE   
T_POWKEY1                      EQU       POWKEY1   -PLLBASE   
T_PLLKEY0                      EQU       PLLKEY0   -PLLBASE   
T_PLLCON                       EQU       PLLCON    -PLLBASE   
T_PLLKEY1                      EQU       PLLKEY1   -PLLBASE   
T_OSC0TRM                      EQU       OSC0TRM   -PLLBASE   
T_OSC0CON                      EQU       OSC0CON   -PLLBASE   
T_OSC0STA                      EQU       OSC0STA   -PLLBASE   
T_OSC0VAL0                     EQU       OSC0VAL0  -PLLBASE   
T_OSC0VAL1                     EQU       OSC0VAL1  -PLLBASE   

PLLSTA_OFFSET                  EQU       0x0400
POWKEY0_OFFSET                 EQU       0x0404
POWCON_OFFSET                  EQU       0x0408
POWKEY1_OFFSET                 EQU       0x040C
PLLKEY0_OFFSET                 EQU       0x0410
PLLCON_OFFSET                  EQU       0x0414
PLLKEY1_OFFSET                 EQU       0x0418
OSC0TRM_OFFSET                 EQU       0x042C
OSC0CON_OFFSET                 EQU       0x0440
OSC0STA_OFFSET                 EQU       0x0444
OSC0VAL0_OFFSET                EQU       0x0448
OSC0VAL1_OFFSET                EQU       0x044C





; ADC interface registers

ADCBASE                        EQU       0xFFFF0500
ADCSTA                         EQU       0xFFFF0500
ADCMSKI                        EQU       0xFFFF0504
ADCMDE                         EQU       0xFFFF0508
ADC0CON                        EQU       0xFFFF050C
ADC1CON                        EQU       0xFFFF0510
ADC2CON                        EQU       0xFFFF0514
ADCFLT                         EQU       0xFFFF0518
ADCCFG                         EQU       0xFFFF051C
ADC0DAT                        EQU       0xFFFF0520
ADC1DAT                        EQU       0xFFFF0524
ADC2DAT                        EQU       0xFFFF0528
ADCFIFO                        EQU       0xFFFF052C
ADC0OF                         EQU       0xFFFF0530
ADC1OF                         EQU       0xFFFF0534
ADC2OF                         EQU       0xFFFF0538
ADC0GN                         EQU       0xFFFF053C
ADC1GN                         EQU       0xFFFF0540
ADC2GN                         EQU       0xFFFF0544
ADC0RCL                        EQU       0xFFFF0548
ADC0RCV                        EQU       0xFFFF054C
ADC0TH                         EQU       0xFFFF0550
ADC0TCL                        EQU       0xFFFF0554
ADC0THV                        EQU       0xFFFF0558
ADC0ACC                        EQU       0xFFFF055C
ADC0ATH                        EQU       0xFFFF0560
ADCREF                         EQU       0xFFFF057C
Z_ADCSTA                       EQU       ADCSTA    -Z_BASE
Z_ADCMSKI                      EQU       ADCMSKI   -Z_BASE
Z_ADCMDE                       EQU       ADCMDE    -Z_BASE
Z_ADC0CON                      EQU       ADC0CON   -Z_BASE
Z_ADC1CON                      EQU       ADC1CON   -Z_BASE
Z_ADC2CON                      EQU       ADC2CON   -Z_BASE
Z_ADCFLT                       EQU       ADCFLT    -Z_BASE
Z_ADCCFG                       EQU       ADCCFG    -Z_BASE
Z_ADC0DAT                      EQU       ADC0DAT   -Z_BASE
Z_ADC1DAT                      EQU       ADC1DAT   -Z_BASE
Z_ADC2DAT                      EQU       ADC2DAT   -Z_BASE
Z_ADCFIFO                      EQU       ADCFIFO   -Z_BASE
Z_ADC0OF                       EQU       ADC0OF    -Z_BASE
Z_ADC1OF                       EQU       ADC1OF    -Z_BASE
Z_ADC2OF                       EQU       ADC2OF    -Z_BASE
Z_ADC0GN                       EQU       ADC0GN    -Z_BASE
Z_ADC1GN                       EQU       ADC1GN    -Z_BASE
Z_ADC2GN                       EQU       ADC2GN    -Z_BASE
Z_ADC0RCL                      EQU       ADC0RCL   -Z_BASE
Z_ADC0RCV                      EQU       ADC0RCV   -Z_BASE
Z_ADC0TH                       EQU       ADC0TH    -Z_BASE
Z_ADC0TCL                      EQU       ADC0TCL   -Z_BASE
Z_ADC0THV                      EQU       ADC0THV   -Z_BASE
Z_ADC0ACC                      EQU       ADC0ACC   -Z_BASE
Z_ADC0ATH                      EQU       ADC0ATH   -Z_BASE
Z_ADCREF                       EQU       ADCREF    -Z_BASE

T_ADCSTA                       EQU       ADCSTA    -ADCBASE   
T_ADCMSKI                      EQU       ADCMSKI   -ADCBASE   
T_ADCMDE                       EQU       ADCMDE    -ADCBASE   
T_ADC0CON                      EQU       ADC0CON   -ADCBASE   
T_ADC1CON                      EQU       ADC1CON   -ADCBASE   
T_ADC2CON                      EQU       ADC2CON   -ADCBASE   
T_ADCFLT                       EQU       ADCFLT    -ADCBASE   
T_ADCCFG                       EQU       ADCCFG    -ADCBASE   
T_ADC0DAT                      EQU       ADC0DAT   -ADCBASE   
T_ADC1DAT                      EQU       ADC1DAT   -ADCBASE   
T_ADC2DAT                      EQU       ADC2DAT   -ADCBASE   
T_ADCFIFO                      EQU       ADCFIFO   -ADCBASE   
T_ADC0OF                       EQU       ADC0OF    -ADCBASE   
T_ADC1OF                       EQU       ADC1OF    -ADCBASE   
T_ADC2OF                       EQU       ADC2OF    -ADCBASE   
T_ADC0GN                       EQU       ADC0GN    -ADCBASE   
T_ADC1GN                       EQU       ADC1GN    -ADCBASE   
T_ADC2GN                       EQU       ADC2GN    -ADCBASE   
T_ADC0RCL                      EQU       ADC0RCL   -ADCBASE   
T_ADC0RCV                      EQU       ADC0RCV   -ADCBASE   
T_ADC0TH                       EQU       ADC0TH    -ADCBASE   
T_ADC0TCL                      EQU       ADC0TCL   -ADCBASE   
T_ADC0THV                      EQU       ADC0THV   -ADCBASE   
T_ADC0ACC                      EQU       ADC0ACC   -ADCBASE   
T_ADC0ATH                      EQU       ADC0ATH   -ADCBASE   
T_ADCREF                       EQU       ADCREF    -ADCBASE   

