vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7032.inc
ADCSTA_OFFSET                  EQU       0x0500
ADCMSKI_OFFSET                 EQU       0x0504
ADCMDE_OFFSET                  EQU       0x0508
ADC0CON_OFFSET                 EQU       0x050C
ADC1CON_OFFSET                 EQU       0x0510
ADC2CON_OFFSET                 EQU       0x0514
ADCFLT_OFFSET                  EQU       0x0518
ADCCFG_OFFSET                  EQU       0x051C
ADC0DAT_OFFSET                 EQU       0x0520
ADC1DAT_OFFSET                 EQU       0x0524
ADC2DAT_OFFSET                 EQU       0x0528
ADCFIFO_OFFSET                 EQU       0x052C
ADC0OF_OFFSET                  EQU       0x0530
ADC1OF_OFFSET                  EQU       0x0534
ADC2OF_OFFSET                  EQU       0x0538
ADC0GN_OFFSET                  EQU       0x053C
ADC1GN_OFFSET                  EQU       0x0540
ADC2GN_OFFSET                  EQU       0x0544
ADC0RCL_OFFSET                 EQU       0x0548
ADC0RCV_OFFSET                 EQU       0x054C
ADC0TH_OFFSET                  EQU       0x0550
ADC0TCL_OFFSET                 EQU       0x0554
ADC0THV_OFFSET                 EQU       0x0558
ADC0ACC_OFFSET                 EQU       0x055C
ADC0ATH_OFFSET                 EQU       0x0560
ADCREF_OFFSET                  EQU       0x057C

; 450 Compatible UART core registers

UARTBASE                       EQU       0xFFFF0700
COMTX                          EQU       0xFFFF0700
COMRX                          EQU       0xFFFF0700
COMDIV0                        EQU       0xFFFF0700
COMIEN0                        EQU       0xFFFF0704
COMDIV1                        EQU       0xFFFF0704
COMIID0                        EQU       0xFFFF0708
COMCON0                        EQU       0xFFFF070C
COMCON1                        EQU       0xFFFF0710
COMSTA0                        EQU       0xFFFF0714
COMDIV2                        EQU       0xFFFF072C
Z_COMTX                        EQU       COMTX     -Z_BASE
Z_COMRX                        EQU       COMRX     -Z_BASE
Z_COMDIV0                      EQU       COMDIV0   -Z_BASE
Z_COMIEN0                      EQU       COMIEN0   -Z_BASE
Z_COMDIV1                      EQU       COMDIV1   -Z_BASE
Z_COMIID0                      EQU       COMIID0   -Z_BASE
Z_COMCON0                      EQU       COMCON0   -Z_BASE
Z_COMCON1                      EQU       COMCON1   -Z_BASE
Z_COMSTA0                      EQU       COMSTA0   -Z_BASE
Z_COMDIV2                      EQU       COMDIV2   -Z_BASE

T_COMTX                        EQU       COMTX     -UARTBASE  
T_COMRX                        EQU       COMRX     -UARTBASE  
T_COMDIV0                      EQU       COMDIV0   -UARTBASE  
T_COMIEN0                      EQU       COMIEN0   -UARTBASE  
T_COMDIV1                      EQU       COMDIV1   -UARTBASE  
T_COMIID0                      EQU       COMIID0   -UARTBASE  
T_COMCON0                      EQU       COMCON0   -UARTBASE  
T_COMCON1                      EQU       COMCON1   -UARTBASE  
T_COMSTA0                      EQU       COMSTA0   -UARTBASE  
T_COMDIV2                      EQU       COMDIV2   -UARTBASE  

COMTX_OFFSET                   EQU       0x0700
COMRX_OFFSET                   EQU       0x0700
COMDIV0_OFFSET                 EQU       0x0700
COMIEN0_OFFSET                 EQU       0x0704
COMDIV1_OFFSET                 EQU       0x0704
COMIID0_OFFSET                 EQU       0x0708
COMCON0_OFFSET                 EQU       0x070C
COMCON1_OFFSET                 EQU       0x0710
COMSTA0_OFFSET                 EQU       0x0714
COMDIV2_OFFSET                 EQU       0x072C

; LIN Hardware SYNC Registers.

LSBASE                         EQU       0xFFFF0780
LHSSTA                         EQU       0xFFFF0780
LHSCON0                        EQU       0xFFFF0784
LHSVAL0                        EQU       0xFFFF0788
LHSCON1                        EQU       0xFFFF078C
LHSVAL1                        EQU       0xFFFF0790
Z_LHSSTA                       EQU       LHSSTA    -Z_BASE
Z_LHSCON0                      EQU       LHSCON0   -Z_BASE
Z_LHSVAL0                      EQU       LHSVAL0   -Z_BASE
Z_LHSCON1                      EQU       LHSCON1   -Z_BASE
Z_LHSVAL1                      EQU       LHSVAL1   -Z_BASE

T_LHSSTA                       EQU       LHSSTA    -LSBASE    
T_LHSCON0                      EQU       LHSCON0   -LSBASE    
T_LHSVAL0                      EQU       LHSVAL0   -LSBASE    
T_LHSCON1                      EQU       LHSCON1   -LSBASE    
T_LHSVAL1                      EQU       LHSVAL1   -LSBASE    

LHSSTA_OFFSET                  EQU       0x0780
LHSCON0_OFFSET                 EQU       0x0784
LHSVAL0_OFFSET                 EQU       0x0788
LHSCON1_OFFSET                 EQU       0x078C
LHSVAL1_OFFSET                 EQU       0x0790

; 2-Wire Interface registers to HV die.

HVBASE                         EQU       0xFFFF0800
HVCON                          EQU       0xFFFF0804
HVDAT                          EQU       0xFFFF080C
Z_HVCON                        EQU       HVCON     -Z_BASE
Z_HVDAT                        EQU       HVDAT     -Z_BASE

T_HVCON                        EQU       HVCON     -HVBASE    
T_HVDAT                        EQU       HVDAT     -HVBASE    

HVCON_OFFSET                   EQU       0x0804
HVDAT_OFFSET                   EQU       0x080C

; Serial Port Interface Peripheral

SPIBASE                        EQU       0xFFFF0A00
SPISTA                         EQU       0xFFFF0A00
SPIRX                          EQU       0xFFFF0A04
SPITX                          EQU       0xFFFF0A08
SPIDIV                         EQU       0xFFFF0A0C
SPICON                         EQU       0xFFFF0A10
Z_SPISTA                       EQU       SPISTA    -Z_BASE
Z_SPIRX                        EQU       SPIRX     -Z_BASE
Z_SPITX                        EQU       SPITX     -Z_BASE
Z_SPIDIV                       EQU       SPIDIV    -Z_BASE
Z_SPICON                       EQU       SPICON    -Z_BASE

T_SPISTA                       EQU       SPISTA    -SPIBASE   
T_SPIRX                        EQU       SPIRX     -SPIBASE   
T_SPITX                        EQU       SPITX     -SPIBASE   
T_SPIDIV                       EQU       SPIDIV    -SPIBASE   
T_SPICON                       EQU       SPICON    -SPIBASE   

